In [1]:
print("This is the tutorial of pandas")

This is the tutorial of pandas

In [ ]:
import pandas as pd

print(pd.__version__)

2.3.0

In [7]:
 #Series
# A Pandas Series is a 1D array-like object that can hold any data type.
# It is similar to column in a table

data = [1,2,3,4,5]
series = pd.Series(data)

print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# Create a series from dictionary

data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)

print(series_dict)

# Now here 'a','b','c','d' becomes the index
# So whatever the keys will be as a index and values as a Series Values

a    1
b    2
c    3
dtype: int64

In [10]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [24]:
# Dataframes

# Create a dataframe from a dictionary of list
data={
  'Name':['Prajwal','Sarthak','Anil'],
  'Age':[25,30,45],
  'City':['Pune','Ny','Nashik'],
}

df=pd.DataFrame(data)
print(df)

print(type(df))

      Name  Age    City
0  Prajwal   25    Pune
1  Sarthak   30      Ny
2     Anil   45  Nashik
<class 'pandas.core.frame.DataFrame'>

In [15]:
import numpy as np
np.array(df)

array([['Prajwal', 25, 'Pune'],
       ['Sarthak', 30, 'Ny'],
       ['Anil', 45, 'Nashik']], dtype=object)

In [18]:
# Create a dataframe from a list of dictionaries

data=[
  {'Name':'Prajwal','Age':22,'City':'Nashik'},
  {'Name':'Sarthak','Age':14,'City':'Nashik'},
]

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age    City
0  Prajwal   22  Nashik
1  Sarthak   14  Nashik
<class 'pandas.core.frame.DataFrame'>

In [72]:
df = pd.read_csv('people-100.csv')


print(df.head(5))  #top 5 elements of a csv file

   Index          User Id First Name Last Name     Sex  \
0      1  88F7B33d2bcf9f5     Shelby   Terrell    Male
1      2  f90cD3E76f1A9b9    Phillip   Summers  Female
2      3  DbeAb8CcdfeFC2c   Kristine    Travis    Male
3      4  A31Bee3c201ef58    Yesenia  Martinez    Male
4      5  1bA7A3dc874da3c       Lori      Todd    Male

                        Email                   Phone Date of birth  \
0        elijah57@example.net  001-084-906-7849x73518    1945-10-26
1       bethany14@example.com       214.112.6044x4913    1910-03-24
2       bthompson@example.com            277.609.7938    1992-07-02
3   kaitlinkaiser@example.com            584.094.6111    2017-08-03
4  buchananmanuel@example.net       689-207-3558x7233    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [25]:
# Accessing data from the dataframe
data

{'Name': ['Prajwal', 'Sarthak', 'Anil'],
 'Age': [25, 30, 45],
 'City': ['Pune', 'Ny', 'Nashik']}

In [26]:
df

      Name  Age    City
0  Prajwal   25    Pune
1  Sarthak   30      Ny
2     Anil   45  Nashik

In [30]:
# Accessing jus the names from the dataframe
print(df['Name'])

# As cols are getting displayed, so they are Series
print(type(df['Name']))

0    Prajwal
1    Sarthak
2       Anil
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
# .loc[] -> Label-based indexing

df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35]
}, index=['a', 'b', 'c'])

print(df.loc['a'])     # Access row with index label 'a'
print("\n")  
print(df.loc['a':'c'])  # Includes 'a' 'b' 'c'
print("\n")  
print(df.loc['a', 'name'])  # 'Alice'

name    Alice
age        25
Name: a, dtype: object


      name  age
a    Alice   25
b      Bob   30
c  Charlie   35


Alice

In [ ]:
# .iloc[] -> Integer position-based indexing

print(df.iloc[0])
print("\n")      # Access first row
print(df.iloc[0:2])    # Returns rows at index 0 and 1 (excludes 2)
print("\n")  
print(df.iloc[0, 0])   # 'Alice' â€” 0th row, 0th column

name    Alice
age        25
Name: a, dtype: object


    name  age
a  Alice   25
b    Bob   30


Alice

In [50]:
# Accessing a specific element 
print(df)

print("\n")
print(df.at['a','age'])
print(df.iat[1,1])

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35


25
30

In [53]:
# Data Manipulation with dataframes
print(df)

print("\n")

# Add a new salary col
df['Salary'] = [50000,60000,70000]

print("\n")

print("New dataframe with salary\n",df)

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35




New dataframe with salary
       name  age  Salary
a    Alice   25   50000
b      Bob   30   60000
c  Charlie   35   70000

In [55]:
# Remove a col

df.drop('Salary',axis=1)

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35

In [ ]:
df         # But here again Salary col appeared

      name  age  Salary
a    Alice   25   50000
b      Bob   30   60000
c  Charlie   35   70000

In [64]:
# Now to permanently delete that col, use inplace
#df.drop('Salary',axis=1,inplace=True)

In [65]:
df

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35

In [71]:
# Add Age to the col

df['age'] = df['age'] + 1
df

      name  age
a    Alice   30
b      Bob   35
c  Charlie   40

In [77]:
# Display the datatype of each col
print("Data types:\n",df.dtypes)

print("\n")

# Describe the dataframe
print("Statistical Summary:\n",df.describe())

print("\n")

Data types:
 Index             int64
User Id          object
First Name       object
Last Name        object
Sex              object
Email            object
Phone            object
Date of birth    object
Job Title        object
dtype: object


Statistical Summary:
             Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000